Siege/logs_ab/log_search_ab_1000.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Finished 31747 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15791 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      31747
Failed requests:        0
Total transferred:      511633824 bytes
HTML transferred:       501347148 bytes
Requests per second:    529.11 [#/sec] (mean)
Time per request:       1889.979 [ms] (mean)
Time per request:       1.890 [ms] (mean, across all concurrent requests)
Transfer rate:          8327.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   5.9      0      45
Processing:    23 1861 243.1   1900    2422
Waiting:        6 1861 243.1   1899    2421
Total:         68 1862 238.4   1900    2422

Percentage of the requests served within a certain time (ms)
  50%   1900
  66%   1940
  75%   1960
  80%   1985
  90%   2035
  95%   2083
  98%   2362
  99%   2394
 100%   2422 (longest request)