Siege/logs_ab/log_search_ab_1000.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 20749 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      1000
Time taken for tests:   60.012 seconds
Complete requests:      20749
Failed requests:        0
Total transferred:      336735521 bytes
HTML transferred:       330012845 bytes
Requests per second:    345.75 [#/sec] (mean)
Time per request:       2892.288 [ms] (mean)
Time per request:       2.892 [ms] (mean, across all concurrent requests)
Transfer rate:          5479.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   8.6      0      53
Processing:    27 2818 367.6   2877    3084
Waiting:        8 2818 367.6   2876    3083
Total:         80 2820 359.5   2877    3084

Percentage of the requests served within a certain time (ms)
  50%   2877
  66%   2887
  75%   2893
  80%   2898
  90%   2927
  95%   3027
  98%   3038
  99%   3043
 100%   3084 (longest request)