Siege/logs_ab/log_search_ab_1200.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Finished 27629 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15853 bytes

Concurrency Level:      1200
Time taken for tests:   60.002 seconds
Complete requests:      27629
Failed requests:        0
Total transferred:      446954333 bytes
HTML transferred:       438002537 bytes
Requests per second:    460.46 [#/sec] (mean)
Time per request:       2606.066 [ms] (mean)
Time per request:       2.172 [ms] (mean, across all concurrent requests)
Transfer rate:          7274.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   8.6      0      55
Processing:    26 2547 342.9   2572    3207
Waiting:        8 2546 343.0   2571    3206
Total:         81 2549 336.5   2572    3207

Percentage of the requests served within a certain time (ms)
  50%   2572
  66%   2615
  75%   2647
  80%   2690
  90%   2847
  95%   2971
  98%   3140
  99%   3157
 100%   3207 (longest request)