Siege/logs_ab/log_search_ab_1300.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 20823 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      1300
Time taken for tests:   60.003 seconds
Complete requests:      20823
Failed requests:        0
Total transferred:      337968925 bytes
HTML transferred:       331221625 bytes
Requests per second:    347.03 [#/sec] (mean)
Time per request:       3746.030 [ms] (mean)
Time per request:       2.882 [ms] (mean, across all concurrent requests)
Transfer rate:          5500.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  14.0      0      77
Processing:    38 3623 520.0   3711    3893
Waiting:       10 3623 520.1   3711    3893
Total:        115 3627 506.9   3712    3893

Percentage of the requests served within a certain time (ms)
  50%   3712
  66%   3733
  75%   3751
  80%   3783
  90%   3832
  95%   3850
  98%   3859
  99%   3867
 100%   3893 (longest request)