Siege/logs_ab/log_search_ab_1600.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Finished 31875 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15791 bytes

Concurrency Level:      1600
Time taken for tests:   60.002 seconds
Complete requests:      31875
Failed requests:        0
Total transferred:      513681740 bytes
HTML transferred:       503353916 bytes
Requests per second:    531.23 [#/sec] (mean)
Time per request:       3011.877 [ms] (mean)
Time per request:       1.882 [ms] (mean, across all concurrent requests)
Transfer rate:          8360.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  10.7      0      61
Processing:    33 2922 424.3   2921    3470
Waiting:        8 2922 424.3   2921    3470
Total:         93 2924 414.8   2922    3470

Percentage of the requests served within a certain time (ms)
  50%   2922
  66%   2979
  75%   3094
  80%   3163
  90%   3229
  95%   3330
  98%   3393
  99%   3428
 100%   3470 (longest request)