Siege/logs_ab/log_search_ab_1800.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Finished 30172 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15791 bytes

Concurrency Level:      1800
Time taken for tests:   60.003 seconds
Complete requests:      30172
Failed requests:        0
Total transferred:      486221780 bytes
HTML transferred:       476446052 bytes
Requests per second:    502.85 [#/sec] (mean)
Time per request:       3579.629 [ms] (mean)
Time per request:       1.989 [ms] (mean, across all concurrent requests)
Transfer rate:          7913.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  14.8      0      82
Processing:    39 3448 506.7   3485    3926
Waiting:        6 3447 506.8   3484    3925
Total:        121 3451 493.6   3485    3926

Percentage of the requests served within a certain time (ms)
  50%   3485
  66%   3638
  75%   3697
  80%   3719
  90%   3762
  95%   3810
  98%   3867
  99%   3873
 100%   3926 (longest request)