Siege/logs_ab/log_search_ab_200.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Finished 33269 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15791 bytes

Concurrency Level:      200
Time taken for tests:   60.005 seconds
Complete requests:      33269
Failed requests:        0
Total transferred:      536129935 bytes
HTML transferred:       525350779 bytes
Requests per second:    554.44 [#/sec] (mean)
Time per request:       360.726 [ms] (mean)
Time per request:       1.804 [ms] (mean, across all concurrent requests)
Transfer rate:          8725.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       9
Processing:     9  359  38.6    350     674
Waiting:        7  359  38.6    350     672
Total:         18  360  38.5    350     674

Percentage of the requests served within a certain time (ms)
  50%    350
  66%    358
  75%    364
  80%    370
  90%    394
  95%    423
  98%    469
  99%    501
 100%    674 (longest request)