Siege/logs_ab/log_search_ab_2600.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Finished 29929 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15853 bytes

Concurrency Level:      2600
Time taken for tests:   60.006 seconds
Complete requests:      29929
Failed requests:        0
Total transferred:      484177610 bytes
HTML transferred:       474480290 bytes
Requests per second:    498.77 [#/sec] (mean)
Time per request:       5212.821 [ms] (mean)
Time per request:       2.005 [ms] (mean, across all concurrent requests)
Transfer rate:          7879.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6  21.7      0     110
Processing:    48 3941 1119.8   4000   49942
Waiting:        7 3941 1119.8   3999   49941
Total:        157 3947 1109.7   4000   50002

Percentage of the requests served within a certain time (ms)
  50%   4000
  66%   4044
  75%   4075
  80%   4099
  90%   4211
  95%   4275
  98%   4848
  99%   5098
 100%  50002 (longest request)