Siege/logs_ab/log_search_ab_3200.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 23675 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15853 bytes

Concurrency Level:      3200
Time taken for tests:   60.006 seconds
Complete requests:      23675
Failed requests:        0
Total transferred:      382990475 bytes
HTML transferred:       375319775 bytes
Requests per second:    394.55 [#/sec] (mean)
Time per request:       8110.599 [ms] (mean)
Time per request:       2.535 [ms] (mean, across all concurrent requests)
Transfer rate:          6232.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10  31.0      0     136
Processing:    61 5027 2274.3   4263   48626
Waiting:        6 5026 2274.3   4262   48626
Total:        195 5036 2262.8   4264   48626

Percentage of the requests served within a certain time (ms)
  50%   4264
  66%   4542
  75%   4640
  80%   4880
  90%   8986
  95%  11035
  98%  11389
  99%  11410
 100%  48626 (longest request)