Siege/logs_ab/log_search_ab_3300.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 15253 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      3300
Time taken for tests:   60.000 seconds
Complete requests:      15253
Failed requests:        0
Total transferred:      247540937 bytes
HTML transferred:       242598965 bytes
Requests per second:    254.22 [#/sec] (mean)
Time per request:       12981.093 [ms] (mean)
Time per request:       3.934 [ms] (mean, across all concurrent requests)
Transfer rate:          4028.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   31  79.1      0     280
Processing:   138 7254 1901.8   7508   52876
Waiting:      137 7254 1901.8   7508   52876
Total:        417 7286 1841.7   7509   52876

Percentage of the requests served within a certain time (ms)
  50%   7509
  66%   7831
  75%   7934
  80%   8043
  90%   8416
  95%   8592
  98%   8605
  99%   8610
 100%  52876 (longest request)